{
    "cough,fever": {
        "disease": "Common Cold",
        "description": "The common cold is a viral infection of the upper respiratory tract. It is usually caused by rhinoviruses. Symptoms include runny nose, sore throat, cough, congestion, mild body aches, and fever. The cold virus is transmitted through airborne droplets or by direct contact with contaminated surfaces. Although generally mild, it can cause significant discomfort. The illness typically resolves in about a week to ten days. Complications are rare but can include sinus infections or middle ear infections. Rest, hydration, and over-the-counter medications can help alleviate symptoms. Antibiotics are not effective as colds are caused by viruses. Preventive measures include frequent handwashing, avoiding close contact with infected individuals, and maintaining a healthy immune system.",
        "medicine": "Rest, fluids, and over-the-counter cold remedies like decongestants, antihistamines, and pain relievers. Avoiding antibiotics unless prescribed for secondary bacterial infections."
    },
    "fever,headache,muscle pain,fatigue": {
        "disease": "Influenza (Flu)",
        "description": "Influenza is a contagious respiratory illness caused by influenza viruses. Symptoms include fever, cough, sore throat, muscle aches, headaches, and fatigue. The flu spreads via respiratory droplets and can also be transmitted by touching contaminated surfaces. It can lead to serious complications such as pneumonia, especially in high-risk groups. Annual flu vaccination is the primary prevention method. Treatment includes antiviral medications, rest, hydration, and symptom management with over-the-counter medications. Most people recover within a week or two, but some may experience prolonged symptoms.",
        "medicine": "Antiviral drugs like oseltamivir, rest, fluids, and over-the-counter medications for symptom relief. Preventive vaccination is recommended annually."
    },
    "chest pain,shortness of breath,sweating,nausea": {
        "disease": "Heart Attack",
        "description": "A heart attack occurs when blood flow to the heart muscle is blocked, usually by a blood clot. Symptoms can include chest pain, shortness of breath, sweating, and nausea. The condition can result from coronary artery disease or other heart conditions. Immediate treatment is crucial to restore blood flow and minimize heart damage. Risk factors include high blood pressure, high cholesterol, smoking, and diabetes. Treatment often involves medications, lifestyle changes, and sometimes procedures like angioplasty. Long-term management includes heart-healthy lifestyle changes and regular follow-ups.",
        "medicine": "Medications like aspirin, beta-blockers, ACE inhibitors, and statins. Immediate interventions may include angioplasty or coronary artery bypass surgery. Lifestyle modifications are essential for prevention."
    },
    "fatigue,weight gain,cold intolerance,constipation": {
        "disease": "Hypothyroidism",
        "description": "Hypothyroidism occurs when the thyroid gland does not produce enough thyroid hormones. Symptoms include fatigue, weight gain, cold intolerance, and constipation. The condition can slow down the body's metabolism and affect various systems. It can be caused by autoimmune diseases like Hashimoto's thyroiditis or by certain medications. Diagnosis is confirmed through blood tests measuring thyroid hormone levels. Treatment involves daily thyroid hormone replacement therapy. Regular monitoring is required to ensure adequate hormone levels and to adjust medication dosages as needed.",
        "medicine": "Thyroid hormone replacement therapy, such as levothyroxine. Regular monitoring and dose adjustments are necessary to manage the condition effectively."
    },
    "abdominal pain,bloating,diarrhea,weight loss": {
        "disease": "Celiac Disease",
        "description": "Celiac disease is an autoimmune disorder where ingestion of gluten leads to inflammation of the small intestine. Symptoms include abdominal pain, bloating, diarrhea, and weight loss. It can also cause anemia, osteoporosis, and neurological symptoms. The disease is diagnosed through blood tests and a biopsy of the small intestine. The only effective treatment is a strict, lifelong gluten-free diet, which allows the intestine to heal and symptoms to resolve. Avoiding gluten-containing foods is crucial for managing the disease and preventing complications.",
        "medicine": "A strict, lifelong gluten-free diet. Nutritional supplements may be necessary to address deficiencies caused by malabsorption."
    },
    "high fever,chills,sweats,headache,nausea,vomiting": {
        "disease": "Malaria",
        "description": "Malaria is caused by parasites transmitted through the bites of infected Anopheles mosquitoes. Symptoms include high fever, chills, sweats, headache, nausea, and vomiting. It can also lead to severe complications like anemia and organ failure. Malaria is common in tropical and subtropical regions. Diagnosis is made through blood tests that detect the presence of malaria parasites. Treatment involves antimalarial medications, which are chosen based on the type of malaria and its severity. Preventive measures include the use of insect repellent, bed nets, and antimalarial drugs in endemic areas.",
        "medicine": "Antimalarial medications such as chloroquine, artemisinin-based combination therapies (ACTs), and supportive care. Preventive measures include mosquito avoidance and prophylactic antimalarials in high-risk areas."
    },
    
    "fever,rash,joint pain,red eyes,headache": {
        "disease": "Zika Virus",
        "description": "Zika virus is transmitted by Aedes mosquitoes and can cause symptoms such as fever, rash, joint pain, red eyes, and headache. The virus is also associated with birth defects, particularly microcephaly, when pregnant women are infected. Zika virus infection is typically mild and may go unnoticed. Diagnosis is confirmed through blood tests. There is no specific treatment for Zika virus, and management focuses on relieving symptoms. Preventive measures include avoiding mosquito bites and eliminating mosquito breeding sites. Pregnant women are advised to take extra precautions to avoid infection.",
        "medicine": "Supportive care includes rest, fluids, and pain relievers like acetaminophen. Avoiding mosquito bites is crucial for prevention."
    },
    "painful urination,frequent urination,cloudy urine,abdominal pain": {
        "disease": "Urinary Tract Infection (UTI)",
        "description": "A urinary tract infection (UTI) occurs when bacteria enter the urinary tract and multiply. Symptoms can include painful urination, frequent urge to urinate, cloudy or strong-smelling urine, and abdominal pain. UTIs can affect any part of the urinary system, including the bladder, kidneys, and urethra. Diagnosis is based on urine tests. Treatment usually involves antibiotics to eliminate the infection. Increasing fluid intake and urination can help flush out bacteria. UTIs are more common in women but can occur in men and children as well. Prevention includes proper hygiene and, in some cases, prophylactic antibiotics for recurrent infections.",
        "medicine": "Antibiotics like trimethoprim-sulfamethoxazole or ciprofloxacin. Increasing hydration and urination can aid in clearing the infection."
    },
    "shortness of breath,wheezing,chest tightness,cough": {
        "disease": "Asthma",
        "description": "Asthma is a chronic inflammatory disease of the airways characterized by reversible airway obstruction. Symptoms include shortness of breath, wheezing, chest tightness, and coughing. Asthma attacks can be triggered by allergens, respiratory infections, exercise, and environmental factors. Diagnosis is made through clinical assessment and spirometry tests. Management includes avoiding triggers, using inhalers (both relievers and preventers), and medications to control inflammation and symptoms. Regular monitoring and personalized treatment plans are essential to managing asthma effectively.",
        "medicine": "Inhalers containing bronchodilators and corticosteroids. Long-term control medications may include leukotriene receptor antagonists and combination inhalers."
    },
    
    "frequent thirst,frequent urination,extreme hunger,fatigue": {
        "disease": "Diabetes Mellitus",
        "description": "Diabetes mellitus is a chronic condition that affects the body's ability to regulate blood glucose levels. It primarily impacts the endocrine system, involving the pancreas and insulin production or action. Symptoms include frequent thirst, frequent urination, extreme hunger, and fatigue.",
        "medicine": "Insulin therapy for Type 1 diabetes, oral hypoglycemic agents for Type 2 diabetes such as metformin (Glucophage) and sulfonylureas (e.g., glipizide). Lifestyle changes including diet and exercise are also crucial."
    },
    "persistent cough,shortness of breath,excessive mucus production": {
        "disease": "Chronic Obstructive Pulmonary Disease (COPD)",
        "description": "COPD is a group of progressive lung diseases including chronic bronchitis and emphysema. It affects the lungs, leading to obstruction of airflow and difficulty breathing. Symptoms include persistent cough, shortness of breath, and excessive mucus production.",
        "medicine": "Medications include bronchodilators such as albuterol (Proventil), inhaled corticosteroids like fluticasone (Flovent), and long-acting beta agonists (e.g., salmeterol). Oxygen therapy and smoking cessation are essential."
    },
    "joint pain,stiffness,swelling,morning stiffness": {
        "disease": "Rheumatoid Arthritis",
        "description": "Rheumatoid arthritis is an autoimmune disorder that primarily affects the joints, leading to pain, stiffness, swelling, and joint damage. It can also cause morning stiffness and fatigue, affecting the synovium of joints throughout the body.",
        "medicine": "Disease-modifying antirheumatic drugs (DMARDs) like methotrexate (Rheumatrex), biological agents such as TNF inhibitors (e.g., etanercept), and nonsteroidal anti-inflammatory drugs (NSAIDs) like ibuprofen."
    },
    "abdominal pain,cramping,diarrhea,weight loss": {
        "disease": "Irritable Bowel Syndrome (IBS)",
        "description": "IBS is a functional gastrointestinal disorder affecting the intestines. Symptoms include abdominal pain, cramping, diarrhea, and weight loss. It is characterized by changes in bowel habits and is not associated with structural abnormalities.",
        "medicine": "Medications to manage symptoms include antidiarrheals such as loperamide (Imodium), laxatives (e.g., polyethylene glycol), antispasmodics like hyoscyamine, and dietary changes such as a low FODMAP diet."
    },
    "red,itchy skin,dry patches,blisters": {
        "disease": "Eczema",
        "description": "Eczema, or atopic dermatitis, is a chronic skin condition affecting the epidermis and dermis. It is characterized by red, itchy, inflamed skin, with dry patches and blisters. It often occurs in individuals with a history of other allergic conditions.",
        "medicine": "Treatment includes topical corticosteroids such as hydrocortisone, moisturizers, and avoiding triggers. In severe cases, oral medications like prednisone and phototherapy may be used."
    },
    "dizziness,ringing in ears,hearing loss,vertigo": {
        "disease": "Meniere's Disease",
        "description": "Meniere's disease is an inner ear disorder that affects balance and hearing. It is characterized by episodes of vertigo, tinnitus (ringing in the ears), hearing loss, and a feeling of fullness in the ear. It results from fluid buildup in the inner ear.",
        "medicine": "Diuretics like hydrochlorothiazide, anti-nausea medications such as meclizine, and lifestyle changes such as a low-sodium diet. In severe cases, surgical interventions like endolymphatic sac decompression may be considered."
    },
    "severe headaches,nausea,vomiting,sensitivity to light": {
        "disease": "Migraine",
        "description": "Migraine is a neurological condition characterized by severe, recurrent headaches that often affect one side of the head. It is accompanied by symptoms such as nausea, vomiting, and sensitivity to light (photophobia). It can be triggered by various factors including stress and dietary choices.",
        "medicine": "Treatment includes abortive medications like triptans (e.g., sumatriptan) and preventive medications such as beta-blockers (e.g., propranolol) and anticonvulsants (e.g., topiramate). Lifestyle changes and identifying triggers are also important."
    },
    "abdominal pain,fever,nausea,vomiting": {
        "disease": "Appendicitis",
        "description": "Appendicitis is an inflammation of the appendix, affecting the lower right abdomen. Symptoms include abdominal pain starting near the navel and moving to the lower right side, fever, nausea, and vomiting. It is usually caused by an obstruction or infection.",
        "medicine": "The primary treatment is surgical removal of the appendix (appendectomy). Antibiotics such as ciprofloxacin and metronidazole are given to manage infection. Early treatment is critical to prevent complications."
    },
    "persistent cough,shortness of breath,weight loss": {
        "disease": "Lung Cancer",
        "description": "Lung cancer is a malignant tumor in the lungs that affects the respiratory system. Symptoms include a persistent cough, shortness of breath, weight loss, and sometimes hemoptysis (coughing up blood). It is often linked to smoking and exposure to carcinogens.",
        "medicine": "Treatment options vary by stage and include surgery, radiation therapy, chemotherapy (e.g., cisplatin), and targeted therapies (e.g., erlotinib). The choice of treatment depends on the cancer stage and overall health."
    
    },  
"persistent headache,nausea,vomiting,sensitivity to light": {
    "disease": "Cluster Headache",
    "description": "Cluster headaches are severe, recurrent headaches that occur in cyclical patterns or clusters. They are characterized by intense pain on one side of the head, often around the eye, and can be accompanied by symptoms such as nausea, vomiting, and sensitivity to light. They tend to occur in episodes, with headaches occurring daily for weeks or months followed by periods of remission.",
    "medicine": "Acute treatments include high-flow oxygen therapy and triptans (e.g., sumatriptan). Preventive treatments may include verapamil, corticosteroids, and lithium. Lifestyle adjustments and avoiding triggers are also recommended."
},
"painful rash,fever,blisters,itchiness": {
    "disease": "Shingles",
    "description": "Shingles is a viral infection caused by the varicella-zoster virus, which also causes chickenpox. It is characterized by a painful, blistering rash that typically appears on one side of the body. Other symptoms include fever, headache, and itching. Shingles is more common in older adults and those with weakened immune systems.",
    "medicine": "Antiviral medications such as acyclovir, valacyclovir, or famciclovir can reduce the severity and duration of the infection. Pain relief medications and corticosteroids may also be used to manage symptoms."
},
"painful joints,morning stiffness,swelling,fever": {
    "disease": "Systemic Lupus Erythematosus (SLE)",
    "description": "Systemic lupus erythematosus is an autoimmune disease that affects multiple organs, including the skin, joints, kidneys, and heart. Symptoms can vary widely but often include joint pain and swelling, morning stiffness, fever, and skin rashes. It is characterized by periods of flare-ups and remissions.",
    "medicine": "Treatment includes nonsteroidal anti-inflammatory drugs (NSAIDs), corticosteroids, and disease-modifying antirheumatic drugs (DMARDs) like hydroxychloroquine. Immunosuppressants may be used for severe cases."
},
"red,swollen,itchy eyes,watery discharge": {
    "disease": "Conjunctivitis (Pink Eye)",
    "description": "Conjunctivitis is an inflammation of the conjunctiva, the thin membrane covering the white part of the eye and the inside of the eyelids. It can be caused by infections, allergies, or irritants. Symptoms include red, swollen, itchy eyes with watery or mucous discharge.",
    "medicine": "Treatment depends on the cause: antihistamines for allergic conjunctivitis, antibiotics for bacterial infections, and antiviral medications for viral conjunctivitis. Keeping the eyes clean and avoiding irritants are also recommended."
},
"chronic diarrhea,abdominal cramping,weight loss": {
    "disease": "Crohn's Disease",
    "description": "Crohn's disease is a type of inflammatory bowel disease (IBD) that can affect any part of the digestive tract. Symptoms include chronic diarrhea, abdominal cramping, weight loss, and sometimes fever. It is a chronic condition with periods of flare-ups and remissions.",
    "medicine": "Treatment may include anti-inflammatory drugs such as mesalamine, immunosuppressants like azathioprine, and biologics such as infliximab. Nutritional support and sometimes surgery may be needed for severe cases."
},
"painful swallowing,hoarseness,frequent throat clearing,globus sensation": {
    "disease": "Gastroesophageal Reflux Disease (GERD)",
    "description": "GERD is a chronic digestive condition where stomach acid frequently flows back into the esophagus, causing irritation. Symptoms include painful swallowing, hoarseness, frequent throat clearing, and a sensation of a lump in the throat (globus).",
    "medicine": "Treatment includes antacids, H2 receptor antagonists, and proton pump inhibitors (PPIs) to reduce stomach acid. Lifestyle changes such as diet modification and avoiding triggers are also recommended."
},
"abdominal bloating,frequent belching,nausea,burping": {
    "disease": "Functional Dyspepsia",
    "description": "Functional dyspepsia is a common digestive disorder characterized by upper abdominal discomfort or pain, bloating, frequent belching, nausea, and sometimes burping. It is not associated with any structural abnormalities or underlying disease.",
    "medicine": "Treatment includes dietary changes, antacids, H2 receptor antagonists, and proton pump inhibitors. Lifestyle modifications such as reducing stress and avoiding trigger foods are also beneficial."
},
"painful,swollen joints,redness,fever": {
    "disease": "Septic Arthritis",
    "description": "Septic arthritis is a joint infection caused by bacteria, viruses, or fungi. It leads to symptoms such as joint pain, swelling, redness, and fever. The infection can damage the joint if not treated promptly.",
    "medicine": "Treatment involves antibiotics to target the specific pathogen causing the infection. In some cases, joint drainage or surgery may be needed. Pain relief and anti-inflammatory medications can also help manage symptoms."
},
"rash,fever,joint pain,malaise": {
    "disease": "Dengue Fever",
    "description": "Dengue fever is a viral illness transmitted by mosquitoes. Symptoms include a high fever, rash, joint pain, muscle pain, and malaise. In severe cases, dengue can lead to bleeding and low blood pressure.",
    "medicine": "There is no specific antiviral treatment for dengue fever. Management focuses on supportive care, including hydration and pain relief with acetaminophen. Avoiding mosquito bites is crucial for prevention."
},
"painful,red,swollen legs,fever,deep vein tenderness": {
    "disease": "Deep Vein Thrombosis (DVT)",
    "description": "DVT occurs when a blood clot forms in a deep vein, usually in the legs. Symptoms can include painful, red, swollen legs, fever, and tenderness in the affected area. It can lead to serious complications if the clot breaks loose and travels to the lungs.",
    "medicine": "Treatment includes anticoagulants (blood thinners) like warfarin or rivaroxaban. In some cases, thrombolytics to dissolve the clot or surgical interventions may be needed. Compression stockings and lifestyle changes may help prevent recurrence."
            
            },
"painful joints,redness,swelling,fever": {
    "disease": "Gout",
    "description": "Gout is a type of inflammatory arthritis caused by the buildup of uric acid crystals in the joints. It often affects the big toe but can involve other joints. Symptoms include sudden, severe pain, redness, swelling, and tenderness in the affected joint.",
    "medicine": "Treatment includes nonsteroidal anti-inflammatory drugs (NSAIDs) like indomethacin, colchicine, and corticosteroids for pain relief and inflammation. Long-term management may involve medications to lower uric acid levels, such as allopurinol."
},
"fever,joint pain,red rash,headache": {
    "disease": "Rheumatic Fever",
    "description": "Rheumatic fever is a complication of untreated streptococcal throat infection, which can cause inflammation in the heart, joints, skin, and brain. Symptoms include fever, joint pain, rash, and headache. It can lead to rheumatic heart disease if not treated properly.",
    "medicine": "Treatment includes antibiotics to eradicate the streptococcal infection, anti-inflammatory medications such as aspirin or corticosteroids, and sometimes heart medications depending on the severity of heart involvement."
},
"skin rash,itchiness,fever,swollen lymph nodes": {
    "disease": "Measles",
    "description": "Measles is a highly contagious viral disease characterized by a distinctive rash, high fever, cough, runny nose, and conjunctivitis. It can lead to serious complications, including pneumonia and encephalitis.",
    "medicine": "Treatment includes supportive care such as rest, hydration, and fever management with antipyretics. Vitamin A supplementation is recommended for children. Vaccination is crucial for prevention."
},
"painful urination,lower abdominal pain,blood in urine,fever": {
    "disease": "Kidney Stones",
    "description": "Kidney stones are hard deposits of minerals and salts that form in the kidneys. Symptoms include severe pain in the back or side, painful urination, blood in the urine, and sometimes fever if an infection is present.",
    "medicine": "Treatment involves pain management with NSAIDs, hydration to help pass the stones, and medications to help break up the stones. In some cases, procedures like shock wave lithotripsy or surgery may be needed to remove larger stones."
},
"sudden weight loss,thirst,frequent urination,fatigue": {
    "disease": "Type 1 Diabetes Mellitus",
    "description": "Type 1 diabetes is a chronic autoimmune condition where the immune system attacks insulin-producing cells in the pancreas. Symptoms include sudden weight loss, extreme thirst, frequent urination, and fatigue.",
    "medicine": "Treatment involves lifelong insulin therapy to regulate blood glucose levels, along with monitoring blood glucose levels regularly. Dietary management and regular exercise are also essential."
},
"persistent cough,fever,night sweats,weight loss": {
    "disease": "Tuberculosis (TB)",
    "description": "Tuberculosis is a bacterial infection caused by Mycobacterium tuberculosis. It primarily affects the lungs and is characterized by a persistent cough, fever, night sweats, and weight loss. It spreads through airborne droplets.",
    "medicine": "Treatment involves a regimen of antibiotics for several months, typically including isoniazid, rifampin, ethambutol, and pyrazinamide. Directly observed therapy (DOT) is often used to ensure compliance."
},
"red,swollen,itchy skin,cracking,blisters": {
    "disease": "Contact Dermatitis",
    "description": "Contact dermatitis is an inflammatory skin condition caused by exposure to allergens or irritants. Symptoms include red, swollen, itchy skin, and sometimes blisters or cracks. It can be acute or chronic.",
    "medicine": "Treatment involves avoiding the offending substance, using topical corticosteroids to reduce inflammation, and applying emollients to soothe the skin. Oral antihistamines may help with itching."
},
"severe abdominal pain,vomiting,fever,jaundice": {
    "disease": "Cholecystitis",
    "description": "Cholecystitis is inflammation of the gallbladder, often due to gallstones. Symptoms include severe abdominal pain, nausea, vomiting, fever, and jaundice. It can lead to complications like gallbladder rupture if untreated.",
    "medicine": "Treatment typically includes antibiotics for infection, pain management, and sometimes surgery (cholecystectomy) to remove the gallbladder. Dietary modifications may also be recommended."
},
"painful,swollen gums,loose teeth,bad breath": {
    "disease": "Periodontitis",
    "description": "Periodontitis is a serious gum infection that damages the soft tissue and, without treatment, can destroy the bone that supports your teeth. Symptoms include swollen, bleeding gums, bad breath, and loose teeth.",
    "medicine": "Treatment involves professional dental cleanings, scaling and root planing, and sometimes surgical procedures. Maintaining good oral hygiene and regular dental visits are crucial for managing the condition."
},
"severe abdominal pain,nausea,vomiting,fever": {
    "disease": "Pancreatitis",
    "description": "Pancreatitis is inflammation of the pancreas, which can be acute or chronic. Symptoms include severe abdominal pain, nausea, vomiting, and fever. It can be caused by gallstones, chronic and heavy alcohol use, or certain medications.",
    "medicine": "Treatment includes hospitalization for supportive care, pain management, and intravenous fluids. The underlying cause must be addressed, such as treating gallstones or managing alcohol intake. In some cases, surgery may be needed."
},
"constant fatigue,unintentional weight loss,difficulty sleeping,fever": {
    "disease": "Chronic Fatigue Syndrome",
    "description": "Chronic fatigue syndrome (CFS) is a complex disorder characterized by persistent, unexplained fatigue that does not improve with rest and worsens with physical or mental activity. Other symptoms can include unintentional weight loss, difficulty sleeping, and fever.",
    "medicine": "There is no specific treatment for CFS. Management focuses on relieving symptoms and may include cognitive behavioral therapy (CBT), medications for pain and sleep disturbances, and lifestyle modifications to balance activity and rest."
},
"tremors,slowness,muscle stiffness": {
        "disease": "Parkinson's Disease",
        "description": "Parkinson's disease is a progressive neurological disorder that affects movement. It develops gradually, sometimes starting with a barely noticeable tremor in just one hand. Symptoms include tremors, slowness of movement (bradykinesia), muscle stiffness, and impaired balance and coordination. The disease occurs due to the loss of dopamine-producing brain cells. There is no cure, but medications and therapies can help manage symptoms.",
        "medicine": "Levodopa combined with carbidopa, dopamine agonists like pramipexole, MAO-B inhibitors such as selegiline, and physical therapy to improve mobility and flexibility."
    },
    "vision loss,weakness,tingling,numbness": {
        "disease": "Multiple Sclerosis",
        "description": "Multiple sclerosis (MS) is an autoimmune disease that affects the central nervous system, leading to a wide range of symptoms including vision loss, muscle weakness, tingling, numbness, and coordination problems. MS occurs when the immune system attacks the protective sheath (myelin) that covers nerve fibers, causing communication issues between the brain and the rest of the body. The disease can progress in different patterns, such as relapsing-remitting or progressive forms.",
        "medicine": "Disease-modifying therapies (DMTs) like interferon-beta, glatiramer acetate, and natalizumab. Corticosteroids for managing relapses and medications to manage specific symptoms such as muscle relaxants and pain relievers."
    },
    "jaundice,fatigue,abdominal pain,nausea": {
        "disease": "Hepatitis B",
        "description": "Hepatitis B is a viral infection that affects the liver and can cause both acute and chronic disease. Symptoms include jaundice (yellowing of the skin and eyes), fatigue, abdominal pain, nausea, loss of appetite, and dark urine. The virus is transmitted through contact with infectious body fluids, such as blood, semen, and vaginal secretions. Chronic hepatitis B can lead to liver cirrhosis or liver cancer.",
        "medicine": "Antiviral medications such as tenofovir and entecavir. In some cases, interferon therapy is used. Vaccination is available for prevention."
    },
    "jaundice,loss of appetite,weight loss,fatigue": {
        "disease": "Hepatitis C",
        "description": "Hepatitis C is a viral infection that causes liver inflammation, sometimes leading to serious liver damage. Common symptoms include jaundice, loss of appetite, weight loss, fatigue, dark urine, and abdominal pain. It is primarily spread through contact with infected blood. Chronic hepatitis C can result in liver cirrhosis or liver cancer if left untreated.",
        "medicine": "Direct-acting antiviral (DAA) medications such as sofosbuvir, ledipasvir, and velpatasvir, which can cure most cases of hepatitis C. Supportive care for liver health and management of complications."
    },
    "fatigue,weakness,pallor,dizziness": {
        "disease": "Anemia",
        "description": "Anemia is a condition in which you lack enough healthy red blood cells to carry adequate oxygen to your body's tissues, resulting in fatigue, weakness, pallor, and dizziness. Causes include iron deficiency, vitamin B12 deficiency, chronic diseases, or genetic disorders like sickle cell anemia. Treatment depends on the underlying cause.",
        "medicine": "Iron supplements for iron deficiency anemia, vitamin B12 injections or oral supplements for B12 deficiency anemia, and medications or treatments for underlying conditions causing anemia."
    },
    "persistent cough,mucus production,shortness of breath,wheezing": {
        "disease": "Bronchitis",
        "description": "Bronchitis is the inflammation of the bronchial tubes, which carry air to and from the lungs. Acute bronchitis is usually caused by viral infections and is characterized by a persistent cough, mucus production, shortness of breath, and wheezing. Chronic bronchitis, a form of chronic obstructive pulmonary disease (COPD), involves ongoing inflammation and is often caused by smoking.",
        "medicine": "For acute bronchitis: rest, fluids, and over-the-counter pain relievers. In some cases, cough suppressants or bronchodilators. For chronic bronchitis: bronchodilators, inhaled steroids, and lifestyle changes such as quitting smoking."
    },
    "high blood pressure,headaches,blurred vision,chest pain": {
        "disease": "Hypertension",
        "description": "Hypertension, or high blood pressure, is a condition in which the force of the blood against the artery walls is too high. It can lead to serious health issues such as heart disease, stroke, and kidney problems. Symptoms may include headaches, blurred vision, chest pain, and shortness of breath, though it often has no symptoms.",
        "medicine": "Medications include diuretics, ACE inhibitors like lisinopril, beta-blockers like metoprolol, calcium channel blockers like amlodipine, and angiotensin II receptor blockers (ARBs) such as losartan. Lifestyle changes such as diet, exercise, and reducing sodium intake are also important."
    },
    "memory loss,confusion,mood changes,behavioral issues": {
        "disease": "Alzheimer's Disease",
        "description": "Alzheimer's disease is a progressive neurodegenerative disorder that causes memory loss, confusion, mood changes, and behavioral issues. It is the most common cause of dementia among older adults. The disease involves the buildup of amyloid plaques and tau tangles in the brain, leading to the death of brain cells and loss of cognitive functions.",
        "medicine": "Cholinesterase inhibitors like donepezil, rivastigmine, and galantamine. NMDA receptor antagonist memantine may also be used. Current treatments focus on managing symptoms as there is no cure."
    },
    "widespread musculoskeletal pain,fatigue,sleep disturbances": {
        "disease": "Fibromyalgia",
        "description": "Fibromyalgia is a chronic condition characterized by widespread musculoskeletal pain, fatigue, sleep disturbances, and often emotional or mental distress. The exact cause is unknown, but it is believed to involve abnormal pain perception processing in the brain. Symptoms can be triggered or worsened by stress, physical activity, or changes in weather.",
        "medicine": "Medications include pain relievers, antidepressants like duloxetine and milnacipran, and anti-seizure drugs like pregabalin. Additionally, exercise, stress management techniques, and cognitive behavioral therapy (CBT) can help manage symptoms."
    },
    "chronic dry cough,shortness of breath,fatigue": {
    "disease": "Interstitial Lung Disease",
    "description": "Interstitial lung disease (ILD) refers to a group of disorders that cause progressive scarring of lung tissue. Symptoms often include a chronic dry cough, shortness of breath, and fatigue. ILD can be caused by various factors including autoimmune diseases, occupational exposures, and certain medications.",
    "medicine": "Treatment focuses on managing symptoms and may include corticosteroids, immunosuppressive medications, and oxygen therapy. Managing underlying causes and lifestyle modifications may also be beneficial."
},
"muscle weakness,tingling,numbness,vision problems": {
    "disease": "Myasthenia Gravis",
    "description": "Myasthenia gravis is an autoimmune disorder that causes weakness in the skeletal muscles. Symptoms include muscle weakness, tingling, numbness, and sometimes vision problems such as double vision or drooping eyelids. It affects the communication between nerves and muscles.",
    "medicine": "Treatment options include anticholinesterase medications like pyridostigmine, immunosuppressants such as corticosteroids, and thymectomy. Plasmapheresis or intravenous immunoglobulin (IVIG) may be used for acute exacerbations."
},
"painful rash,fever,blisters,headache": {
    "disease": "Herpes Simplex Virus (HSV) Infection",
    "description": "Herpes simplex virus infection is characterized by painful blisters or sores, typically on the mouth or genital area, along with fever and headache. It can be recurrent and is spread through direct contact with an infected person.",
    "medicine": "Antiviral medications such as acyclovir, valacyclovir, or famciclovir can help reduce the severity and duration of outbreaks. Pain relief medications and topical treatments may also be used."
},
"severe abdominal pain,diarrhea,fever": {
    "disease": "Gastroenteritis",
    "description": "Gastroenteritis is inflammation of the stomach and intestines often caused by viral or bacterial infections. Symptoms include severe abdominal pain, diarrhea, and fever. It can be caused by contaminated food or water.",
    "medicine": "Treatment includes staying hydrated, rest, and medications to manage symptoms such as anti-nausea drugs or antidiarrheals. Antibiotics may be needed if a bacterial cause is identified."
},
"extreme thirst,fatigue,frequent urination,dry skin": {
    "disease": "Diabetic Ketoacidosis (DKA)",
    "description": "Diabetic ketoacidosis is a serious complication of diabetes where the body starts breaking down fats at an excessive rate, leading to high blood sugar levels and ketones in the urine. Symptoms include extreme thirst, fatigue, frequent urination, and dry skin.",
    "medicine": "Immediate treatment includes intravenous fluids, insulin therapy to lower blood glucose levels, and electrolyte replacement. Monitoring and adjusting insulin therapy are crucial for managing DKA."
},
"swollen,red,stiff joints,pain": {
    "disease": "Psoriatic Arthritis",
    "description": "Psoriatic arthritis is an inflammatory arthritis associated with psoriasis. Symptoms include swollen, red, and stiff joints, and pain. It can affect any part of the body and can lead to joint damage if not treated.",
    "medicine": "Treatment includes nonsteroidal anti-inflammatory drugs (NSAIDs), disease-modifying antirheumatic drugs (DMARDs) like methotrexate, and biologic agents. Topical treatments for psoriasis and physical therapy may also be beneficial."
},
"persistent stomach pain,nausea,vomiting,loss of appetite": {
    "disease": "Peptic Ulcer Disease",
    "description": "Peptic ulcer disease is characterized by sores that develop on the lining of the stomach, small intestine, or esophagus. Symptoms include persistent stomach pain, nausea, vomiting, and loss of appetite. It is often caused by infection with Helicobacter pylori or the use of nonsteroidal anti-inflammatory drugs (NSAIDs).",
    "medicine": "Treatment typically involves medications to reduce stomach acid such as proton pump inhibitors (PPIs), antibiotics if H. pylori is present, and antacids. Avoiding NSAIDs and managing stress are also recommended."
},
"painful urination,fever,back pain,nausea": {
    "disease": "Pyelonephritis",
    "description": "Pyelonephritis is a type of urinary tract infection that affects the kidneys. Symptoms include painful urination, fever, back pain, and nausea. It can be caused by bacteria traveling up the urinary tract from the bladder.",
    "medicine": "Treatment involves antibiotics to treat the infection and analgesics for pain management. Severe cases may require hospitalization for intravenous antibiotics and fluids."
},
"persistent joint pain,fatigue,swollen lymph nodes,fever": {
    "disease": "Systemic Juvenile Idiopathic Arthritis",
    "description": "Systemic juvenile idiopathic arthritis (SJIA) is an inflammatory condition in children that affects the joints and can also involve systemic symptoms such as fever and swollen lymph nodes. It may lead to persistent joint pain and fatigue.",
    "medicine": "Treatment includes nonsteroidal anti-inflammatory drugs (NSAIDs), disease-modifying antirheumatic drugs (DMARDs) like methotrexate, and biologics. Corticosteroids may be used for severe symptoms."
},
"loss of muscle mass,weakness,fatigue,weight loss": {
    "disease": "Cachexia",
    "description": "Cachexia is a complex syndrome associated with underlying illness, characterized by loss of muscle mass, weakness, fatigue, and weight loss. It is often seen in chronic conditions such as cancer, chronic heart failure, and chronic obstructive pulmonary disease (COPD).",
    "medicine": "Management focuses on treating the underlying disease, nutritional support, and sometimes medications such as appetite stimulants or anabolic agents to help improve muscle mass and overall strength."
},
"shortness of breath,chest pain,cough,swelling in legs": {
    "disease": "Congestive Heart Failure",
    "description": "Congestive heart failure occurs when the heart is unable to pump blood effectively, leading to symptoms such as shortness of breath, chest pain, cough, and swelling in the legs. It is often a result of other conditions such as coronary artery disease or hypertension.",
    "medicine": "Treatment includes diuretics to reduce fluid buildup, ACE inhibitors to lower blood pressure, beta-blockers to improve heart function, and lifestyle changes such as diet and exercise. In severe cases, advanced therapies or surgery may be required."
},


"headache,visual disturbances,nausea,neck stiffness": {
    "disease": "Meningitis",
    "description": "Meningitis is an inflammation of the protective membranes covering the brain and spinal cord. Symptoms include headache, visual disturbances, nausea, and neck stiffness. It can be caused by bacterial, viral, or fungal infections.",
    "medicine": "Treatment depends on the cause of meningitis. Bacterial meningitis requires prompt antibiotic treatment, while viral meningitis often improves on its own with supportive care. Corticosteroids may be used to reduce inflammation."
},

"abdominal bloating,gas,constipation,diarrhea": {
    "disease": "Irritable Bowel Syndrome (IBS)",
    "description": "Irritable bowel syndrome is a functional gastrointestinal disorder characterized by abdominal bloating, gas, constipation, and diarrhea. It is often influenced by stress and dietary factors.",
    "medicine": "Management includes dietary modifications, such as a low-FODMAP diet, stress reduction techniques, and medications to relieve specific symptoms, such as antispasmodics or laxatives."
},

"painful,swollen joints,fever,rash": {
    "disease": "Systemic Lupus Erythematosus (SLE)",
    "description": "Systemic lupus erythematosus is an autoimmune disease where the immune system attacks healthy tissues. Symptoms include painful, swollen joints, fever, and a characteristic rash. It can affect various organs, including the skin, kidneys, and heart.",
    "medicine": "Treatment includes medications to manage symptoms and prevent flare-ups, such as corticosteroids, antimalarials, and immunosuppressants. Regular monitoring and lifestyle modifications are also important."
},
"chronic fatigue,headache,sleep disturbances,unexplained muscle pain": {
    "disease": "Fibromyalgia",
    "description": "Fibromyalgia is a chronic condition characterized by widespread muscle pain, fatigue, and sleep disturbances. The exact cause is unknown, but it is thought to involve abnormal pain processing in the brain and nervous system.",
    "medicine": "Treatment focuses on managing symptoms and may include medications such as pain relievers, antidepressants, and anti-seizure drugs. Physical therapy, cognitive behavioral therapy, and lifestyle changes can also help manage symptoms."
},"swelling of the extremities,shortness of breath,fatigue,rapid weight gain": {
    "disease": "Congestive Heart Failure",
    "description": "Congestive heart failure is a condition in which the heart is unable to pump effectively, leading to fluid accumulation in the lungs and other tissues. Symptoms include swelling of the extremities, shortness of breath, fatigue, and rapid weight gain due to fluid retention.",
    "medicine": "Treatment involves diuretics to reduce fluid buildup, ACE inhibitors or ARBs to lower blood pressure, and beta-blockers to improve heart function. Lifestyle changes and managing underlying conditions are also crucial."
},"joint pain,skin rash,fatigue,fever": {
    "disease": "Systemic Lupus Erythematosus (SLE)",
    "description": "Systemic lupus erythematosus (SLE) is an autoimmune disease that can affect multiple organ systems. Symptoms include joint pain, skin rash (often a butterfly-shaped rash across the cheeks), fatigue, and fever. It can cause inflammation and damage to various organs.",
    "medicine": "Treatment typically includes corticosteroids and immunosuppressive drugs to control inflammation, along with medications to manage specific symptoms. Regular monitoring and lifestyle modifications are also important."
},"severe chest pain,shortness of breath,diaphoresis,nausea": {
    "disease": "Myocardial Infarction (Heart Attack)",
    "description": "A myocardial infarction, commonly known as a heart attack, occurs when blood flow to the heart muscle is obstructed, leading to severe chest pain, shortness of breath, diaphoresis (sweating), and nausea. It is a medical emergency.",
    "medicine": "Immediate treatment includes aspirin to prevent further clotting, thrombolytics or angioplasty to restore blood flow, and medications such as beta-blockers, ACE inhibitors, and statins. Long-term management involves lifestyle changes and possibly surgical interventions."
},"red,itchy skin rash,blisters,dry skin,swelling": {
    "disease": "Eczema (Atopic Dermatitis)",
    "description": "Eczema, also known as atopic dermatitis, is a chronic skin condition that causes red, itchy, and inflamed skin. It can also lead to blisters, dry skin, and swelling. It is often associated with other atopic conditions like asthma or hay fever.",
    "medicine": "Treatment includes topical corticosteroids to reduce inflammation, moisturizers to prevent dryness, and antihistamines to relieve itching. Avoiding known triggers and irritants is also important."
},"swollen and tender lymph nodes,fatigue,fever,night sweats": {
    "disease": "Lymphoma",
    "description": "Lymphoma is a type of cancer that affects the lymphatic system. Symptoms include swollen and tender lymph nodes, fatigue, fever, and night sweats. It can be classified into Hodgkin lymphoma and non-Hodgkin lymphoma, each with different treatment approaches.",
    "medicine": "Treatment may involve chemotherapy, radiation therapy, targeted therapies, or immunotherapy, depending on the type and stage of lymphoma. Supportive care and regular monitoring are also important."
},"unexplained weight loss,fatigue,frequent infections,persistent cough": {
    "disease": "Chronic Obstructive Pulmonary Disease (COPD)",
    "description": "Chronic obstructive pulmonary disease (COPD) is a progressive lung disease that causes obstructed airflow and breathing difficulties. Symptoms include unexplained weight loss, fatigue, frequent infections, and a persistent cough, often producing mucus.",
    "medicine": "Treatment includes bronchodilators and inhaled corticosteroids to manage symptoms, along with lifestyle changes such as smoking cessation and pulmonary rehabilitation. Oxygen therapy may be necessary for advanced cases."
},"joint stiffness,fatigue,painful swelling,fever": {
    "disease": "Rheumatoid Arthritis",
    "description": "Rheumatoid arthritis is an autoimmune disorder that primarily affects the joints, causing joint stiffness, pain, swelling, and fatigue. It can lead to joint damage if not managed properly.",
    "medicine": "Treatment includes disease-modifying antirheumatic drugs (DMARDs) like methotrexate, biological agents, and nonsteroidal anti-inflammatory drugs (NSAIDs) to manage symptoms and slow disease progression."
},"severe abdominal pain,fever,vomiting,jaundice": {
    "disease": "Hepatitis",
    "description": "Hepatitis is inflammation of the liver often caused by viral infections. Symptoms include severe abdominal pain, fever, vomiting, and jaundice (yellowing of the skin and eyes).",
    "medicine": "Treatment varies depending on the type of hepatitis. It may include antiviral medications, lifestyle changes, and monitoring of liver function. Vaccines are available for hepatitis A and B."
},
"confusion,disorientation,weakness,fever": {
    "disease": "Encephalitis",
    "description": "Encephalitis is inflammation of the brain caused by infections or autoimmune responses. Symptoms include confusion, disorientation, weakness, and fever. It can be life-threatening if not treated promptly.",
    "medicine": "Treatment typically involves antiviral or antibiotic medications depending on the cause, along with supportive care such as fluids and pain relief. Corticosteroids may be used to reduce inflammation."
}, "abdominal swelling,pain,nausea,loss of appetite": {
    "disease": "Ascites",
    "description": "Ascites is the accumulation of fluid in the abdominal cavity, often due to liver disease or cancer. Symptoms include abdominal swelling, pain, nausea, and loss of appetite.",
    "medicine": "Treatment involves managing the underlying cause, diuretics to reduce fluid buildup, and in some cases, paracentesis to remove excess fluid."
},"abdominal pain,fever,jaundice,weight loss": {
    "disease": "Amoebic Liver Abscess",
    "description": "An amoebic liver abscess is a type of liver infection caused by Entamoeba histolytica. Symptoms include abdominal pain, fever, jaundice, and weight loss.",
    "medicine": "Treatment typically involves antibiotics such as metronidazole or tinidazole, and sometimes surgical drainage may be necessary."
},
"abdominal pain,diarrhea,fatigue,fever": {
    "disease": "Adenovirus Infection",
    "description": "Adenovirus infection can cause a range of symptoms including abdominal pain, diarrhea, fatigue, and fever. It often affects the respiratory or gastrointestinal systems.",
    "medicine": "Management includes supportive care such as hydration and rest. Antiviral medications are not typically used unless the infection is severe or involves specific strains."
},
"joint pain,skin rash,fever,muscle aches": {
    "disease": "Alkaptonuria",
    "description": "Alkaptonuria is a rare metabolic disorder characterized by the accumulation of homogentisic acid in the body. Symptoms include joint pain, skin rash, fever, and muscle aches. The condition can lead to arthritis and darkening of the urine.",
    "medicine": "Treatment focuses on managing symptoms and may include pain relief, physical therapy, and dietary changes to manage the buildup of homogentisic acid."
},
"skin lesions,fever,headache,swelling": {
    "disease": "African Tick Bite Fever",
    "description": "African Tick Bite Fever is caused by Rickettsia species transmitted through tick bites. Symptoms include skin lesions, fever, headache, and swelling at the site of the bite.",
    "medicine": "Antibiotics such as doxycycline are commonly used for treatment. Avoiding tick bites and prompt medical attention are essential."
}
,"persistent cough,night sweats,fever,weight loss": {
    "disease": "Brucellosis",
    "description": "Brucellosis is an infection caused by Brucella bacteria, often contracted from unpasteurized dairy products or contact with infected animals. Symptoms include a persistent cough, night sweats, fever, and weight loss.",
    "medicine": "Treatment involves a combination of antibiotics such as doxycycline and rifampin. Avoiding raw dairy products and proper handling of animals are preventive measures."
},
"muscle weakness,fatigue,swallowing difficulties,weight loss": {
    "disease": "Bulbar Palsy",
    "description": "Bulbar palsy is a condition affecting the nerves responsible for speaking, swallowing, and chewing. Symptoms include muscle weakness, fatigue, swallowing difficulties, and weight loss.",
    "medicine": "Management includes supportive care, speech and swallowing therapy, and medications to manage symptoms and underlying conditions."
}
,"joint pain,fever,skin rash,muscle weakness": {
    "disease": "Chikungunya",
    "description": "Chikungunya is a viral infection transmitted by mosquitoes. Symptoms include joint pain, fever, skin rash, and muscle weakness. The disease is often associated with long-term joint pain.",
    "medicine": "There is no specific antiviral treatment; management focuses on relieving symptoms with pain relievers and anti-inflammatory medications. Preventing mosquito bites is crucial."
},
"fever,sore throat,red eyes,rash": {
    "disease": "Coxsackievirus Infection",
    "description": "Coxsackievirus infection can cause a range of symptoms including fever, sore throat, red eyes, and rash. It often affects children and can lead to hand, foot, and mouth disease.",
    "medicine": "Treatment is supportive, including hydration and pain relief. Antiviral medications are not usually necessary, but maintaining good hygiene is important to prevent spread."
},
"abdominal pain,fever,diarrhea,jaundice": {
    "disease": "Cryptosporidiosis",
    "description": "Cryptosporidiosis is a parasitic infection caused by Cryptosporidium species. Symptoms include abdominal pain, fever, diarrhea, and jaundice. It is often associated with contaminated water.",
    "medicine": "Treatment includes supportive care and anti-parasitic medications such as nitazoxanide. Ensuring access to clean water and proper hygiene practices are preventive measures."
},"persistent cough,fever,shortness of breath,fatigue": {
    "disease": "Diphtheria",
    "description": "Diphtheria is a bacterial infection caused by Corynebacterium diphtheriae. Symptoms include a persistent cough, fever, shortness of breath, and fatigue. It can cause severe throat inflammation and systemic symptoms.",
    "medicine": "Treatment involves antibiotics such as penicillin or erythromycin and administration of diphtheria antitoxin. Vaccination is the primary preventive measure."
},
"muscle pain,fever,rash,swelling": {
    "disease": "Dengue Fever",
    "description": "Dengue fever is a viral illness transmitted by mosquitoes, characterized by muscle pain, fever, rash, and swelling. It can lead to severe complications such as dengue hemorrhagic fever or dengue shock syndrome.",
    "medicine": "Supportive care is essential, including hydration and pain relief. Severe cases may require hospitalization. Preventing mosquito bites is crucial."
},
"fever,headache,joint pain,muscle pain": {
    "disease": "Dermatomyositis",
    "description": "Dermatomyositis is an inflammatory disease characterized by muscle weakness and a distinctive skin rash. Symptoms include fever, headache, joint pain, and muscle pain.",
    "medicine": "Treatment includes corticosteroids and immunosuppressive drugs. Physical therapy and managing symptoms are important for improving quality of life."
},
"fever,abdominal pain,joint pain,rash": {
    "disease": "Erythema Infectiosum",
    "description": "Erythema infectiosum, also known as fifth disease, is caused by parvovirus B19. Symptoms include fever, abdominal pain, joint pain, and a characteristic rash that appears as a 'slapped cheek' appearance in children.",
    "medicine": "Treatment is supportive, including rest and hydration. Antiviral medications are not usually needed, and the disease typically resolves on its own."
},
"persistent cough,fever,chest pain,difficulty breathing": {
    "disease": "Empyema",
    "description": "Empyema is a collection of pus in the pleural space of the lungs, usually resulting from an infection such as pneumonia. Symptoms include a persistent cough, fever, chest pain, and difficulty breathing.",
    "medicine": "Treatment involves antibiotics and, in some cases, surgical drainage of the pus. Management of underlying infections and supportive care are also important."
}
,"fever,headache,muscle pain,skin rash": {
    "disease": "Febrile Neutropenia",
    "description": "Febrile neutropenia is a condition where a patient with low neutrophil counts develops a fever. It is often seen in cancer patients undergoing chemotherapy. Symptoms include fever, headache, muscle pain, and skin rash.",
    "medicine": "Treatment involves prompt administration of broad-spectrum antibiotics and supportive care. Managing underlying cancer or condition is crucial."
},
"persistent fever,rash,swollen lymph nodes,joint pain": {
    "disease": "Fever of Unknown Origin (FUO)",
    "description": "Fever of unknown origin is a diagnosis given when a prolonged fever persists without an identifiable cause despite extensive investigation. Symptoms include persistent fever, rash, swollen lymph nodes, and joint pain.",
    "medicine": "Treatment depends on the underlying cause once identified. Empirical treatment and supportive care are provided until a diagnosis is made."
}
,"fever,headache,abdominal pain,joint pain": {
    "disease": "Granulomatosis with Polyangiitis",
    "description": "Granulomatosis with polyangiitis (Wegener's granulomatosis) is a type of vasculitis that affects blood vessels and organs. Symptoms include fever, headache, abdominal pain, and joint pain.",
    "medicine": "Treatment involves immunosuppressive medications such as corticosteroids and cytotoxic drugs. Management of symptoms and regular monitoring are important."
},
"cough,fever,chest pain,difficulty breathing": {
    "disease": "Goodpasture's Syndrome",
    "description": "Goodpasture's syndrome is a rare autoimmune disease that attacks the lungs and kidneys. Symptoms include cough, fever, chest pain, and difficulty breathing. It can lead to kidney failure if not treated.",
    "medicine": "Treatment includes immunosuppressive drugs and plasmapheresis. Managing kidney function and supportive care are also necessary."
}
,"fever,skin rash,swollen lymph nodes,joint pain": {
    "disease": "Henoch-Schnlein Purpura",
    "description": "Henoch-Schnlein purpura is a small-vessel vasculitis that often follows a respiratory infection. Symptoms include fever, skin rash, swollen lymph nodes, and joint pain.",
    "medicine": "Treatment focuses on managing symptoms with medications such as corticosteroids. Most cases resolve with supportive care and symptom management."
},
"muscle pain,fever,headache,fatigue": {
    "disease": "Hypereosinophilia",
    "description": "Hypereosinophilia is a condition characterized by an elevated level of eosinophils in the blood, which can lead to inflammation and damage to various organs. Symptoms include muscle pain, fever, headache, and fatigue.",
    "medicine": "Treatment involves corticosteroids and other immunosuppressive drugs. Addressing underlying conditions and monitoring eosinophil levels are key aspects of management."
},"fever,skin rash,joint pain,muscle weakness": {
    "disease": "Infectious Mononucleosis",
    "description": "Infectious mononucleosis, often caused by Epstein-Barr virus, presents with fever, skin rash, joint pain, and muscle weakness. It is also known as mono or glandular fever.",
    "medicine": "Supportive care is the main treatment, including rest, hydration, and pain relief. Severe cases may require corticosteroids to reduce inflammation."
},
"fever,chronic cough,weight loss,night sweats": {
    "disease": "Idiopathic Pulmonary Fibrosis",
    "description": "Idiopathic pulmonary fibrosis is a chronic lung disease with unknown cause that leads to progressive scarring of lung tissue. Symptoms include fever, chronic cough, weight loss, and night sweats.",
    "medicine": "Treatment includes antifibrotic drugs such as pirfenidone or nintedanib, and supportive care such as oxygen therapy and pulmonary rehabilitation."
}
,"fever,skin rash,swelling,abdominal pain": {
    "disease": "Jardiance Syndrome",
    "description": "Jardiance Syndrome is not a widely recognized medical condition but could refer to adverse reactions associated with the use of the medication Jardiance. Symptoms may include fever, skin rash, swelling, and abdominal pain.",
    "medicine": "Treatment involves discontinuing the medication and managing symptoms with supportive care. Alternative medications may be considered depending on the condition being treated."
},
"fever,rash,swelling,joint pain": {
    "disease": "Juvenile Idiopathic Arthritis (JIA)",
    "description": "Juvenile idiopathic arthritis is an inflammatory arthritis in children. Symptoms include fever, rash, swelling, and joint pain. It can affect one or more joints and may cause long-term joint damage if untreated.",
    "medicine": "Treatment includes nonsteroidal anti-inflammatory drugs (NSAIDs), disease-modifying antirheumatic drugs (DMARDs), and biologics. Physical therapy and regular monitoring are also important."
},"fever,headache,confusion,skin rash": {
    "disease": "Kawasaki Disease",
    "description": "Kawasaki disease is a rare condition that primarily affects children and involves inflammation of blood vessels. Symptoms include fever, headache, confusion, and skin rash.",
    "medicine": "Treatment typically involves high-dose aspirin and intravenous immunoglobulin (IVIG). Early treatment is crucial to prevent complications such as coronary artery damage."
},
"fever,shortness of breath,chest pain,joint pain": {
    "disease": "Klinefelter Syndrome",
    "description": "Klinefelter syndrome is a genetic condition in males caused by an extra X chromosome. It can lead to various symptoms, including fever, shortness of breath, chest pain, and joint pain, though it is often associated with infertility and hormonal imbalances.",
    "medicine": "Treatment focuses on managing symptoms and may include hormone replacement therapy, physical therapy, and fertility treatment if needed."
},"fever,headache,muscle aches,rash": {
    "disease": "Legionnaires' Disease",
    "description": "Legionnaires' disease is a type of pneumonia caused by the Legionella bacteria. Symptoms include fever, headache, muscle aches, and rash. It is often contracted from contaminated water sources.",
    "medicine": "Antibiotics such as azithromycin or levofloxacin are used to treat Legionnaires' disease. Supportive care including hydration and oxygen therapy may also be necessary."
},
"fever,joint pain,skin rash,muscle weakness": {
    "disease": "Lupus Erythematosus",
    "description": "Systemic lupus erythematosus (SLE) is an autoimmune disease that can affect multiple organs. Symptoms include fever, joint pain, skin rash, and muscle weakness.",
    "medicine": "Treatment involves antimalarial drugs, corticosteroids, and immunosuppressive medications. Management also includes regular monitoring and lifestyle adjustments."
}
,"fever,abdominal pain,joint pain,skin rash": {
    "disease": "Meningococcal Disease",
    "description": "Meningococcal disease is a severe bacterial infection that can lead to meningitis or septicemia. Symptoms include fever, abdominal pain, joint pain, and skin rash.",
    "medicine": "Immediate treatment with antibiotics such as penicillin or ceftriaxone is essential. Vaccination is also recommended to prevent infection."
},
"fever,swollen lymph nodes,weight loss,fatigue": {
    "disease": "Monoclonal Gammopathy of Undetermined Significance (MGUS)",
    "description": "Monoclonal gammopathy of undetermined significance is a condition where an abnormal protein is found in the blood. Symptoms can include fever, swollen lymph nodes, weight loss, and fatigue.",
    "medicine": "Regular monitoring is crucial, as MGUS can sometimes progress to more serious conditions. Treatment focuses on managing symptoms and addressing any complications."
}
,"fever,joint pain,swollen lymph nodes,rash": {
    "disease": "Neuroborreliosis",
    "description": "Neuroborreliosis is a neurological manifestation of Lyme disease, caused by the bacterium Borrelia burgdorferi. Symptoms include fever, joint pain, swollen lymph nodes, and rash.",
    "medicine": "Antibiotics such as doxycycline or ceftriaxone are used to treat neuroborreliosis. Early treatment is important to prevent long-term neurological damage."
},

"fever,headache,muscle pain,joint pain": {
    "disease": "Osteomyelitis",
    "description": "Osteomyelitis is an infection of the bone that can be acute or chronic. Symptoms include fever, headache, muscle pain, and joint pain.",
    "medicine": "Treatment involves antibiotics targeted at the infecting organism and, in some cases, surgical intervention to remove infected tissue. Pain management and supportive care are also important."
},
"fever,chronic cough,shortness of breath,weight loss": {
    "disease": "Onchocerciasis (River Blindness)",
    "description": "Onchocerciasis, or river blindness, is a parasitic disease caused by Onchocerca volvulus. Symptoms include fever, chronic cough, shortness of breath, and weight loss. It can lead to severe skin and eye complications.",
    "medicine": "Ivermectin is the primary treatment for onchocerciasis. Community-wide treatment programs are often used to control and prevent the disease."
}
,
"fever,skin rash,joint pain,swollen lymph nodes": {
    "disease": "Primary Sjgren's Syndrome",
    "description": "Primary Sjgren's syndrome is an autoimmune disorder characterized by dry mouth and eyes. Symptoms may also include fever, skin rash, joint pain, and swollen lymph nodes.",
    "medicine": "Management includes symptomatic treatments such as artificial tears and saliva substitutes. Immunosuppressive drugs may be used in more severe cases."
}

,"fever,skin rash,muscle pain,joint pain": {
    "disease": "Rocky Mountain Spotted Fever",
    "description": "Rocky Mountain spotted fever is a tick-borne illness caused by Rickettsia rickettsii. Symptoms include fever, skin rash, muscle pain, and joint pain.",
    "medicine": "Doxycycline is the primary treatment. Early antibiotic treatment is crucial for preventing severe complications."
},

"fever,skin rash,swollen lymph nodes,muscle pain": {
    "disease": "Systemic Sclerosis (Scleroderma)",
    "description": "Systemic sclerosis, or scleroderma, is an autoimmune disease characterized by the hardening and tightening of skin and connective tissues. Symptoms include fever, skin rash, swollen lymph nodes, and muscle pain.",
    "medicine": "Treatment focuses on managing symptoms and may include immunosuppressive drugs, corticosteroids, and medications to improve blood flow."
},
"fever,cough,chest pain,difficulty breathing": {
    "disease": "Sarcoidosis",
    "description": "Sarcoidosis is an inflammatory disease that often affects the lungs and lymph nodes. Symptoms include fever, cough, chest pain, and difficulty breathing.",
    "medicine": "Treatment may include corticosteroids to reduce inflammation and other immunosuppressive medications if necessary. Regular monitoring and supportive care are important."
}
,"fever,headache,joint pain,rash": {
    "disease": "Typhoid Fever",
    "description": "Typhoid fever is a bacterial infection caused by Salmonella typhi. Symptoms include fever, headache, joint pain, and rash.",
    "medicine": "Antibiotics such as ciprofloxacin or azithromycin are used to treat typhoid fever. Supportive care and hydration are also important."
},
"fever,cough,chest pain,shortness of breath": {
    "disease": "Klebsiella Pneumonia",
    "description": "Klebsiella pneumonia is a type of bacterial pneumonia caused by Klebsiella bacteria. Symptoms include fever, cough, chest pain, and shortness of breath. It can be severe and requires prompt treatment.",
    "medicine": "Treatment involves antibiotics tailored to the specific bacterial strain. Supportive care, including oxygen therapy, may be necessary for severe cases."
},"fatigue,joint pain,abdominal pain,diarrhea,weight loss": {
    "disease": "Addison's Disease",
    "description": "Addison's disease is a disorder that occurs when the adrenal glands do not produce enough hormones. Symptoms include fatigue, joint pain, abdominal pain, diarrhea, and weight loss.",
    "medicine": "Treatment involves hormone replacement therapy to correct the levels of steroid hormones the body isnt producing."
},
"nausea,vomiting,severe headache,neck stiffness,confusion": {
    "disease": "Aseptic Meningitis",
    "description": "Aseptic meningitis is inflammation of the membranes covering the brain and spinal cord, usually caused by a viral infection. Symptoms include nausea, vomiting, severe headache, neck stiffness, and confusion.",
    "medicine": "Treatment may include rest, fluids, and pain relievers. Antiviral medication may be required in some cases."
},
"shortness of breath,chest pain,coughing up blood,fatigue": {
    "disease": "Aortic Dissection",
    "description": "Aortic dissection is a serious condition in which the inner layer of the aorta tears, leading to blood flow between the layers of the aorta wall. Symptoms include shortness of breath, chest pain, coughing up blood, and fatigue.",
    "medicine": "Treatment often involves emergency surgery or medication to reduce heart rate and blood pressure."
},
"fever,cough,chills,muscle pain,shortness of breath": {
    "disease": "Acute Respiratory Distress Syndrome (ARDS)",
    "description": "ARDS is a condition in which fluid collects in the lungs' air sacs, depriving organs of oxygen. It is often caused by trauma or infection.",
    "medicine": "Treatment typically involves oxygen therapy and mechanical ventilation to support breathing."
},
"fever,fatigue,joint pain,skin rash,muscle pain": {
    "disease": "Anaplasmosis",
    "description": "Anaplasmosis is a tick-borne disease caused by bacteria, leading to symptoms like fever, fatigue, joint pain, skin rash, and muscle pain.",
    "medicine": "Treatment usually involves antibiotics such as doxycycline."
},
"fatigue,shortness of breath,rapid heart rate,pale skin": {
    "disease": "Aplastic Anemia",
    "description": "Aplastic anemia is a condition where the bone marrow fails to produce enough blood cells, leading to symptoms like fatigue, shortness of breath, rapid heart rate, and pale skin.",
    "medicine": "Treatment may involve blood transfusions, bone marrow transplants, or medications to stimulate bone marrow production."
}
,"fever,headache,joint pain,muscle pain,skin rash": {
    "disease": "Babesiosis",
    "description": "Babesiosis is a malaria-like parasitic disease caused by infection with Babesia, a genus of protozoa. It is transmitted by ticks.",
    "medicine": "Treatment typically includes a combination of antimicrobial drugs such as atovaquone and azithromycin."
},
"fever,weight loss,fatigue,night sweats,abdominal pain": {
    "disease": "Brucellosis",
    "description": "Brucellosis is an infectious disease caused by bacteria of the genus Brucella, which spreads from animals to humans.",
    "medicine": "Treatment usually involves antibiotics like doxycycline and rifampin."
},
"fever,sore throat,cough,shortness of breath,chest pain": {
    "disease": "Bronchitis",
    "description": "Bronchitis is inflammation of the bronchial tubes, often following a cold or respiratory infection, resulting in a persistent cough.",
    "medicine": "Treatment includes rest, fluids, pain relievers, and sometimes bronchodilators or antibiotics."
},
"fatigue,itchy skin,jaundice,abdominal pain,weight loss": {
    "disease": "Biliary Atresia",
    "description": "Biliary atresia is a condition in infants in which the bile ducts outside and inside the liver are scarred and blocked.",
    "medicine": "Treatment usually involves surgery (Kasai procedure) or liver transplantation."
},
"fatigue,weight loss,paleness,bleeding gums,easy bruising": {
    "disease": "B-Cell Acute Lymphoblastic Leukemia (B-ALL)",
    "description": "B-ALL is a type of cancer in which the bone marrow makes too many immature white blood cells (B-cell lymphoblasts).",
    "medicine": "Treatment includes chemotherapy, targeted therapy, and sometimes stem cell transplants."
},
"fever,red skin rash,blisters,swelling,skin pain": {
    "disease": "Bullous Pemphigoid",
    "description": "Bullous pemphigoid is a rare skin condition that causes large, fluid-filled blisters. It usually affects older adults.",
    "medicine": "Treatment typically involves corticosteroids and immunosuppressive drugs."
}
,"cough,fever,shortness of breath,chest pain,fatigue": {
    "disease": "Cryptococcosis",
    "description": "Cryptococcosis is a fungal infection caused by Cryptococcus species, affecting the lungs or the central nervous system.",
    "medicine": "Treatment usually involves antifungal medications like amphotericin B and fluconazole."
},
"fever,weight loss,night sweats,coughing up blood,fatigue": {
    "disease": "Chronic Pulmonary Aspergillosis",
    "description": "Chronic pulmonary aspergillosis is a long-term fungal infection that affects the lungs and may develop after a lung disease.",
    "medicine": "Treatment involves long-term antifungal medication, often itraconazole or voriconazole."
},
"fever,joint pain,red eyes,muscle pain,skin rash": {
    "disease": "Chikungunya",
    "description": "Chikungunya is a viral disease transmitted by mosquitoes, leading to symptoms such as fever, joint pain, and rash.",
    "medicine": "There is no specific treatment; supportive care includes rest, fluids, and pain relievers."
},
"chest pain,shortness of breath,fatigue,swelling in legs": {
    "disease": "Cardiomyopathy",
    "description": "Cardiomyopathy refers to diseases of the heart muscle that make it harder for the heart to pump blood to the rest of the body.",
    "medicine": "Treatment options include medications, implanted devices, and surgery depending on the type of cardiomyopathy."
},

"itching,swelling,redness,fever,chills": {
    "disease": "Cellulitis",
    "description": "Cellulitis is a common bacterial skin infection that causes redness, swelling, and pain in the affected area.",
    "medicine": "Treatment typically involves antibiotics, either oral or intravenous, depending on the severity."
},"fever,headache,stiff neck,sensitivity to light,nausea": {
    "disease": "Dengue Fever",
    "description": "Dengue fever is a mosquito-borne viral infection causing severe flu-like illness, and sometimes developing into a potentially lethal complication called severe dengue.",
    "medicine": "There is no specific treatment for dengue fever. Supportive care includes rest, fluids, and pain relievers such as acetaminophen."
},
"fever,sore throat,swollen lymph nodes,weakness,rash": {
    "disease": "Diphtheria",
    "description": "Diphtheria is a serious bacterial infection affecting the mucous membranes of the throat and nose.",
    "medicine": "Treatment involves antitoxins and antibiotics like erythromycin or penicillin."
},
"frequent urination,extreme thirst,increased hunger,unexplained weight loss,fatigue": {
    "disease": "Diabetes Mellitus",
    "description": "Diabetes mellitus is a metabolic disorder characterized by high blood sugar levels over a prolonged period.",
    "medicine": "Management includes insulin therapy, oral medications, diet, and exercise."
},
"abdominal pain,diarrhea,fever,bloody stools,weight loss": {
    "disease": "Diverticulitis",
    "description": "Diverticulitis occurs when pouches (diverticula) formed in the wall of the colon become inflamed or infected.",
    "medicine": "Treatment includes antibiotics, a liquid diet, and in some cases, surgery."
},
"chest pain,shortness of breath,dizziness,rapid heart rate,fatigue": {
    "disease": "Dilated Cardiomyopathy",
    "description": "Dilated cardiomyopathy is a condition in which the heart's ability to pump blood is decreased because the heart's main pumping chamber is enlarged and weakened.",
    "medicine": "Treatment involves medications, implanted devices, or surgery, depending on the severity."
},
"muscle pain,weakness,stiffness,swelling of muscles,difficulty swallowing": {
    "disease": "Dermatomyositis",
    "description": "Dermatomyositis is a rare inflammatory disease marked by muscle weakness and a distinctive skin rash.",
    "medicine": "Treatment includes corticosteroids, immunosuppressants, and physical therapy."
},"fever,chills,nausea,vomiting,abdominal pain,yellowing of the skin and eyes": {
    "disease": "Ebola Virus Disease",
    "description": "Ebola virus disease is a severe and often fatal illness caused by the Ebola virus. It leads to internal bleeding and organ failure.",
    "medicine": "Treatment includes supportive care, rehydration, and experimental treatments like monoclonal antibodies."
},
"fever,cough,shortness of breath,chest pain,weakness": {
    "disease": "Empyema",
    "description": "Empyema is a collection of pus within a naturally existing anatomical cavity, typically the pleural cavity.",
    "medicine": "Treatment often involves antibiotics and drainage of the infected fluid."
},
"fever,fatigue,headache,muscle aches,joint pain,swollen lymph nodes": {
    "disease": "Epstein-Barr Virus Infection",
    "description": "Epstein-Barr virus (EBV) is a common virus that causes infectious mononucleosis, also known as glandular fever.",
    "medicine": "Treatment is usually supportive, including rest, fluids, and over-the-counter pain and fever medications."
},
"red eyes,watery eyes,itchy eyes,swollen eyelids": {
    "disease": "Episcleritis",
    "description": "Episcleritis is an inflammation of the episclera, the thin layer of tissue covering the white part of the eye.",
    "medicine": "Treatment may include artificial tears and, in some cases, anti-inflammatory medications."
},
"shortness of breath,coughing,wheezing,chest tightness,fatigue": {
    "disease": "Emphysema",
    "description": "Emphysema is a chronic lung condition that causes shortness of breath due to over-inflation of the air sacs (alveoli) in the lungs.",
    "medicine": "Treatment includes bronchodilators, corticosteroids, and oxygen therapy."
},
"high fever,headache,vomiting,stiff neck,sensitivity to light": {
    "disease": "Encephalitis",
    "description": "Encephalitis is inflammation of the brain, usually due to a viral infection, leading to symptoms like high fever, headache, and stiff neck.",
    "medicine": "Treatment may involve antiviral medications, corticosteroids, and supportive care."
},
"fever,headache,chills,nausea,vomiting,back pain": {
    "disease": "Filariasis",
    "description": "Filariasis is a parasitic disease caused by thread-like roundworms and transmitted by mosquitoes.",
    "medicine": "Treatment typically involves antiparasitic drugs like diethylcarbamazine (DEC) or ivermectin."
},
"fatigue,muscle pain,joint pain,sensitivity to cold,headache": {
    "disease": "Fibromyalgia",
    "description": "Fibromyalgia is a chronic condition characterized by widespread musculoskeletal pain, fatigue, and tenderness in localized areas.",
    "medicine": "Treatment includes medications, physical therapy, and lifestyle changes."
},
"fever,chest pain,cough,shortness of breath,chills": {
    "disease": "Fungal Pneumonia",
    "description": "Fungal pneumonia is an infection of the lungs caused by various types of fungi.",
    "medicine": "Treatment involves antifungal medications like fluconazole or amphotericin B."
},
"pain in the upper right abdomen,nausea,vomiting,fatigue,jaundice": {
    "disease": "Fatty Liver Disease",
    "description": "Fatty liver disease is a condition in which excess fat builds up in the liver. It can lead to liver inflammation and scarring.",
    "medicine": "Treatment includes weight loss, healthy diet, and controlling blood sugar levels."
},
"fever,red skin rash,muscle pain,joint pain,headache": {
    "disease": "Fifth Disease",
    "description": "Fifth disease is a mild viral infection that often causes a distinctive red rash on the face.",
    "medicine": "Treatment is usually supportive, including rest, fluids, and over-the-counter pain relievers."
},
"skin lesions,bone pain,fever,anemia,swollen lymph nodes": {
    "disease": "Follicular Lymphoma",
    "description": "Follicular lymphoma is a type of non-Hodgkin's lymphoma, a cancer of the lymphatic system.",
    "medicine": "Treatment may involve chemotherapy, immunotherapy, and sometimes radiation therapy."
},
"abdominal pain,bloating,diarrhea,flatulence,weight loss": {
    "disease": "Giardiasis",
    "description": "Giardiasis is an intestinal infection caused by the protozoan parasite Giardia lamblia, leading to diarrhea and digestive disturbances.",
    "medicine": "Treatment typically involves antibiotics like metronidazole or tinidazole."
},
"fatigue,pale skin,shortness of breath,rapid heart rate,dizziness": {
    "disease": "G6PD Deficiency",
    "description": "G6PD deficiency is a genetic disorder that leads to hemolytic anemia, often triggered by certain foods, infections, or medications.",
    "medicine": "Treatment involves avoiding triggers and, in some cases, blood transfusions."
},
"pain and swelling in the joints,especially the big toe,red and warm skin,fever": {
    "disease": "Gout",
    "description": "Gout is a form of arthritis characterized by sudden, severe attacks of pain, redness, and tenderness in joints.",
    "medicine": "Treatment includes medications like nonsteroidal anti-inflammatory drugs (NSAIDs), colchicine, and corticosteroids."
},
"fatigue,weight loss,pale skin,shortness of breath,fainting": {
    "disease": "Gastrointestinal Stromal Tumor (GIST)",
    "description": "GIST is a type of tumor that occurs in the digestive tract, often presenting as a painless mass or with symptoms of bleeding.",
    "medicine": "Treatment typically involves surgery, and sometimes targeted therapy with drugs like imatinib."
},
"fatigue,weakness,yellowing of the skin and eyes,abdominal pain,nausea": {
    "disease": "Gilbert's Syndrome",
    "description": "Gilbert's syndrome is a mild liver disorder where the liver doesnt properly process bilirubin, leading to jaundice.",
    "medicine": "No treatment is usually necessary, but managing stress and maintaining a healthy lifestyle is advised."
},
"fever,sore throat,red eyes,skin rash,swollen lymph nodes": {
    "disease": "German Measles (Rubella)",
    "description": "Rubella, also known as German measles, is a contagious viral infection preventable by vaccine and is characterized by a red rash.",
    "medicine": "Treatment is usually supportive, including rest and fluids."
}
,
"fever,cough,shortness of breath,fatigue,chills": {
    "disease": "Hantavirus Pulmonary Syndrome",
    "description": "Hantavirus pulmonary syndrome (HPS) is a severe respiratory disease in humans caused by infection with hantaviruses.",
    "medicine": "Treatment is supportive, including oxygen therapy and intensive care."
},
"fatigue,weakness,joint pain,yellowing of the skin and eyes,abdominal pain": {
    "disease": "Hepatitis B",
    "description": "Hepatitis B is a viral infection that attacks the liver and can cause both acute and chronic disease.",
    "medicine": "Treatment includes antiviral medications and, in some cases, liver transplantation."
},
"fever,headache,muscle aches,swollen lymph nodes,chills": {
    "disease": "Hantavirus Infection",
    "description": "Hantavirus infection is a potentially deadly disease transmitted by rodents, leading to hemorrhagic fever with renal syndrome or pulmonary syndrome.",
    "medicine": "Treatment is supportive and may require intensive care."
},
"swelling in the arms and legs,shortness of breath,fatigue,weight gain": {
    "disease": "Heart Failure",
    "description": "Heart failure, also known as congestive heart failure, occurs when the heart cannot pump enough blood to meet the body's needs.",
    "medicine": "Treatment includes lifestyle changes, medications like ACE inhibitors or beta-blockers, and sometimes surgery."
},
"nausea,vomiting,loss of appetite,fatigue,jaundice": {
    "disease": "Hemochromatosis",
    "description": "Hemochromatosis is an inherited condition in which the body absorbs too much iron from the diet, leading to iron overload and damage to organs.",
    "medicine": "Treatment involves regular blood removal (phlebotomy) to reduce iron levels."
},
"fever,headache,chills,muscle pain,rash": {
    "disease": "Hemorrhagic Fever",
    "description": "Hemorrhagic fever is a group of illnesses caused by several types of viruses, leading to severe, life-threatening bleeding, fever, and shock.",
    "medicine": "Treatment is supportive, including fluid replacement, and sometimes antiviral medications."
}
,"fever,chills,muscle pain,cough,chest pain": {
    "disease": "Influenza",
    "description": "Influenza (flu) is a viral infection that attacks your respiratory system  your nose, throat, and lungs.",
    "medicine": "Treatment includes rest, fluids, antiviral medications like oseltamivir, and over-the-counter pain relievers."
},
"abdominal pain,diarrhea,weight loss,fever,fatigue": {
    "disease": "Irritable Bowel Syndrome (IBS)",
    "description": "IBS is a common disorder that affects the large intestine, causing symptoms like abdominal pain, bloating, and altered bowel habits.",
    "medicine": "Treatment includes dietary changes, medications to relieve symptoms, and stress management."
},
"fever,abdominal pain,diarrhea,vomiting,headache": {
    "disease": "Intestinal Tuberculosis",
    "description": "Intestinal tuberculosis is a type of extrapulmonary tuberculosis that affects the gastrointestinal tract.",
    "medicine": "Treatment involves a long-term course of antibiotics, typically the same as for pulmonary tuberculosis."
},
"fever,chills,muscle pain,joint pain,headache": {
    "disease": "Infectious Mononucleosis",
    "description": "Infectious mononucleosis, also known as mono, is a viral infection commonly caused by the Epstein-Barr virus, leading to fever, sore throat, and swollen lymph nodes.",
    "medicine": "Treatment is supportive, including rest, fluids, and over-the-counter pain and fever medications."
},
"itching,redness,swelling,blisters,pain": {
    "disease": "Irritant Contact Dermatitis",
    "description": "Irritant contact dermatitis is a type of inflammation of the skin caused by exposure to an irritant, leading to itching, redness, and swelling.",
    "medicine": "Treatment involves avoiding the irritant and using topical corticosteroids to reduce inflammation."
},
"fever,sore throat,swollen lymph nodes,rash,fatigue": {
    "disease": "Idiopathic Thrombocytopenic Purpura (ITP)",
    "description": "ITP is a disorder that can lead to easy or excessive bruising and bleeding, resulting from unusually low levels of platelets.",
    "medicine": "Treatment may include corticosteroids, immune globulin, or platelet transfusions."
}
,
"fever,joint pain,muscle pain,skin rash,red eyes": {
    "disease": "Japanese Encephalitis",
    "description": "Japanese encephalitis is a viral brain infection spread through mosquito bites, primarily affecting people in Asia.",
    "medicine": "Treatment is supportive, as there is no specific antiviral therapy for Japanese encephalitis."
},
"fever,headache,stiff neck,nausea,vomiting": {
    "disease": "Joubert Syndrome",
    "description": "Joubert syndrome is a rare genetic disorder that affects the area of the brain that controls balance and coordination.",
    "medicine": "Treatment is supportive and focuses on managing symptoms, including physical and occupational therapy."
},
"yellowing of the skin and eyes,itchiness,dark urine,fatigue": {
    "disease": "Jaundice",
    "description": "Jaundice is a condition in which the skin, whites of the eyes, and mucous membranes turn yellow due to a high level of bilirubin.",
    "medicine": "Treatment depends on the underlying cause and may include phototherapy, medications, or surgery."
},
"joint pain,swelling,redness,stiffness,fatigue": {
    "disease": "Juvenile Idiopathic Arthritis",
    "description": "Juvenile idiopathic arthritis (JIA) is the most common type of arthritis in children under the age of 16, causing persistent joint pain, swelling, and stiffness.",
    "medicine": "Treatment includes nonsteroidal anti-inflammatory drugs (NSAIDs), corticosteroids, and disease-modifying antirheumatic drugs (DMARDs)."
},
"frequent urination,increased thirst,increased hunger,weight loss,fatigue": {
    "disease": "Juvenile Diabetes (Type 1 Diabetes)",
    "description": "Juvenile diabetes, or Type 1 diabetes, is a chronic condition in which the pancreas produces little or no insulin.",
    "medicine": "Treatment involves insulin therapy, blood sugar monitoring, healthy eating, and exercise."
},
"pain in the jaw,swelling,redness,difficulty opening the mouth,fever": {
    "disease": "Jaw Tumor",
    "description": "Jaw tumors and cysts are relatively rare lesions that develop in the bones or soft tissues of the jaw, potentially causing pain and swelling.",
    "medicine": "Treatment may involve surgery, radiation therapy, or chemotherapy, depending on the type and severity of the tumor."
}
,"fever,cough,shortness of breath,chest pain,fatigue": {
    "disease": "Klebsiella Pneumonia",
    "description": "Klebsiella pneumonia is a type of bacterial pneumonia caused by the Klebsiella pneumoniae bacterium, often leading to severe respiratory symptoms.",
    "medicine": "Treatment typically involves antibiotics like cephalosporins or carbapenems."
},
"fever,swollen lymph nodes,fatigue,weight loss,night sweats": {
    "disease": "Kaposi Sarcoma",
    "description": "Kaposi sarcoma is a type of cancer that forms in the lining of blood and lymph vessels, often associated with immunocompromised individuals.",
    "medicine": "Treatment may include chemotherapy, radiation therapy, or antiretroviral therapy in HIV-positive patients."
},
"fever,rash,joint pain,swollen lymph nodes,conjunctivitis": {
    "disease": "Kawasaki Disease",
    "description": "Kawasaki disease is a condition that causes inflammation in the walls of some blood vessels in the body, primarily affecting young children.",
    "medicine": "Treatment includes intravenous immunoglobulin (IVIG) and aspirin to reduce inflammation and prevent heart complications."
},
"fever,nausea,vomiting,muscle pain,confusion,swelling of the brain": {
    "disease": "Kernicterus",
    "description": "Kernicterus is a rare type of brain damage that can occur in newborns with severe jaundice.",
    "medicine": "Treatment involves immediate phototherapy or exchange transfusion to reduce bilirubin levels."
},
"pain and swelling in the knee,stiffness,redness,limited range of motion": {
    "disease": "Knee Osteoarthritis",
    "description": "Knee osteoarthritis is a degenerative joint disease that results from the breakdown of cartilage in the knee joint, leading to pain and stiffness.",
    "medicine": "Treatment includes pain relievers, physical therapy, and, in some cases, joint replacement surgery."
}

}
    








